sisext-sapi-services/src/main/resources/soap/schemas/templates/soap-consultaHistoricoCUN-request.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:tem="http://tempuri.org/">
    <soapenv:Header/>
    <soapenv:Body>
        <tem:HistoricoCUN>
            <!--Optional:-->
            <tem:NumCun>#[payload.historicalCun.cunNumber]</tem:NumCun>
            <!--Optional:-->
            <tem:Identificacion>#[payload.historicalCun.identification]</tem:Identificacion>
            <!--Optional:-->
            <tem:NumConexion>#[payload.historicalCun.connectionNumber]</tem:NumConexion>
            <!--Optional:-->
            <tem:TipoIdentificacion>#[payload.historicalCun.identificationType]</tem:TipoIdentificacion>
            <!--Optional:-->
            <tem:Usuario>#[p('entregaCUN.consultaHistorico.user')]</tem:Usuario>
            <!--Optional:-->
            <tem:Contrasena>#[p('entregaCUN.consultaHistorico.password')]</tem:Contrasena>
        </tem:HistoricoCUN>
    </soapenv:Body>
</soapenv:Envelope>